In [1]:
import pandas as pd
import numpy as np

In [2]:
#Q21
cols = pd.MultiIndex.from_tuples([("a", "x"), ("a", "y"), ("a", "z")])
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
df

   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

In [3]:
df.columns = df.columns.droplevel(0)
df

   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

In [4]:
df = pd.DataFrame([[1,2,3], [3,4,5], [5,6,7]], columns=cols)
df

   a
   x  y  z
0  1  2  3
1  3  4  5
2  5  6  7

In [5]:
df.columns = df.columns.droplevel(1)
df

   a  a  a
0  1  2  3
1  3  4  5
2  5  6  7

In [7]:
#Q22
df.insert(loc=1, column='b', value=[1,2,7])
df

   a  b  a  a
0  1  1  2  3
1  3  2  4  5
2  5  7  6  7

In [11]:
#Q23
print(df.to_string(index=False))

 a  b  a  a
 1  1  2  3
 3  2  4  5
 5  7  6  7

In [12]:
#Q24
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]},
     index = ['t1', 't2', 't3', 't4', 't5', 't6'])
df

   school_code class            name date_of_birth  weight
t1        s001     V  Alberto Franco    15/05/2002    35.0
t2        s002     V    Gino Mcneill    17/05/2002     NaN
t3        s003    VI     Ryan Parkes    16/02/1999    33.0
t4        s001    VI    Eesha Hinton    25/09/1998    30.0
t5        s002     V    Gino Mcneill    11/05/2002    31.0
t6        s004    VI    David Parkes    15/09/1997     NaN

In [13]:
index = df['weight'].index[df['weight'].apply(np.isnan)]
df_index = df.index.values.tolist()
print([df_index.index(i) for i in index])

[1, 5]

In [14]:
#Q25
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None]})
df

  school_code class            name date_of_birth  weight
0        s001     V  Alberto Franco    15/05/2002    35.0
1        s002     V    Gino Mcneill    17/05/2002     NaN
2        s003    VI     Ryan Parkes    16/02/1999    33.0
3        s001    VI    Eesha Hinton    25/09/1998    30.0
4        s002     V    Gino Mcneill    11/05/2002    31.0
5        s004    VI    David Parkes    15/09/1997     NaN

In [16]:
print(df.index)

RangeIndex(start=0, stop=6, step=1)

In [17]:
df.index += 10
df.index

RangeIndex(start=10, stop=16, step=1)

In [18]:
df

   school_code class            name date_of_birth  weight
10        s001     V  Alberto Franco    15/05/2002    35.0
11        s002     V    Gino Mcneill    17/05/2002     NaN
12        s003    VI     Ryan Parkes    16/02/1999    33.0
13        s001    VI    Eesha Hinton    25/09/1998    30.0
14        s002     V    Gino Mcneill    11/05/2002    31.0
15        s004    VI    David Parkes    15/09/1997     NaN

In [19]:
#Q26
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 37, 33, 30, 31, 32],
    'tcode': ['t1', 't2', 't3', 't4', 't5', 't6']})    
print("Original DataFrame:")
print(df)
print("\nCreate MultiIndex on 'tcode' and 'school_code':")
df = df.set_index(['tcode', 'school_code'])
print(df)

Original DataFrame:
  school_code class            name date_of_birth  weight tcode
0        s001     V  Alberto Franco    15/05/2002      35    t1
1        s002     V    Gino Mcneill    17/05/2002      37    t2
2        s003    VI     Ryan Parkes    16/02/1999      33    t3
3        s001    VI    Eesha Hinton    25/09/1998      30    t4
4        s002     V    Gino Mcneill    11/05/2002      31    t5
5        s004    VI    David Parkes    15/09/1997      32    t6

Create MultiIndex on 'tcode' and 'school_code':
                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t2    s002            V    Gino Mcneill    17/05/2002      37
t3    s003           VI     Ryan Parkes    16/02/1999      33
t4    s001           VI    Eesha Hinton    25/09/1998      30
t5    s002            V    Gino Mcneill    11/05/2002      31
t6    s004           VI    David Parkes    15/09/1997      32

In [20]:
df.query("tcode=='t3'")

                  class         name date_of_birth  weight
tcode school_code
t3    s003           VI  Ryan Parkes    16/02/1999      33

In [21]:
df.query('school_code=="s002"')

                  class          name date_of_birth  weight
tcode school_code
t2    s002            V  Gino Mcneill    17/05/2002      37
t5    s002            V  Gino Mcneill    11/05/2002      31

In [22]:
df.query(("tcode == 't1'")and("school_code == 's001'"))

                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35
t4    s001           VI    Eesha Hinton    25/09/1998      30

In [23]:
df.query("tcode == 't1' and school_code == 's001'")

                  class            name date_of_birth  weight
tcode school_code
t1    s001            V  Alberto Franco    15/05/2002      35